SpenceKonde/DxCore/megaavr/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification


menu.chip=Chip
menu.bodvoltage=BOD Voltage
menu.bodmodeactive=BOD Mode (active)
menu.bodmodesleep=BOD Mode (sleep)
menu.eesave=Save EEPROM
menu.clock=Clock Speed
menu.millis=millis()/micros()
menu.resetpin=Reset pin function
menu.adcworkaround=ADC Workaround mode
menu.bootloaderusart=Bootloader Serial Port
menu.timeout=Bootloader Timeout



##############################################################

#########################################
#
#    28 PIN AVR Dx-series
#
#########################################


avrdx28.name=28-pin AVR DA or DB

avrdx28.bootloader.SYSCFG1=0x03

avrdx28.menu.chip.128A=AVR128DA28
avrdx28.menu.chip.128A.build.mcu=avr128da28
avrdx28.menu.chip.128A.upload.maximum_size=131072
avrdx28.menu.chip.128A.upload.maximum_data_size=16384
avrdx28.menu.chip.64A=AVR64DA28
avrdx28.menu.chip.64A.build.mcu=avr64da28
avrdx28.menu.chip.64A.upload.maximum_size=65536
avrdx28.menu.chip.64A.upload.maximum_data_size=8192
avrdx28.menu.chip.32A=AVR32DA28
avrdx28.menu.chip.32A.build.mcu=avr32da28
avrdx28.menu.chip.32A.upload.maximum_size=32768
avrdx28.menu.chip.32A.upload.maximum_data_size=4096
avrdx28.menu.chip.128B=AVR128DB28
avrdx28.menu.chip.128B.build.mcu=avr128db28
avrdx28.menu.chip.128B.upload.maximum_size=131072
avrdx28.menu.chip.128B.upload.maximum_data_size=16384
avrdx28.menu.chip.128B.bootloader.SYSCFG1=0x0B


avrdx28.menu.clock.24=24 MHz
avrdx28.menu.clock.24.build.f_cpu=24000000L
avrdx28.menu.clock.24.build.speed=24
avrdx28.menu.clock.20=20 MHz
avrdx28.menu.clock.20.build.f_cpu=20000000L
avrdx28.menu.clock.20.build.speed=20
avrdx28.menu.clock.16=16 MHz
avrdx28.menu.clock.16.build.f_cpu=16000000L
avrdx28.menu.clock.16.build.speed=16
avrdx28.menu.clock.12=12 MHz
avrdx28.menu.clock.12.build.f_cpu=12000000L
avrdx28.menu.clock.12.build.speed=12
avrdx28.menu.clock.10=10 MHz
avrdx28.menu.clock.10.build.f_cpu=10000000L
avrdx28.menu.clock.10.build.speed=10
avrdx28.menu.clock.8=8 MHz
avrdx28.menu.clock.8.build.f_cpu=8000000L
avrdx28.menu.clock.8.build.speed=8
avrdx28.menu.clock.4=4 MHz
avrdx28.menu.clock.4.build.f_cpu=4000000L
avrdx28.menu.clock.4.build.speed=4
avrdx28.menu.clock.1=1 MHz
avrdx28.menu.clock.1.build.f_cpu=1000000L
avrdx28.menu.clock.1.build.speed=1
avrdx28.menu.clock.28=28 MHz (overclocked)
avrdx28.menu.clock.28.build.f_cpu=28000000L
avrdx28.menu.clock.28.build.speed=28
avrdx28.menu.clock.32=32 MHz (overclocked)
avrdx28.menu.clock.32.build.f_cpu=32000000L
avrdx28.menu.clock.32.build.speed=32

avrdx28.build.adcworkaround=
avrdx28.menu.adcworkaround.simple=Enabled
avrdx28.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx28.menu.adcworkaround.none=Disabled


avrdx28.menu.bodvoltage.1v9=1.9V
avrdx28.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx28.menu.bodvoltage.2v45=2.45V
avrdx28.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx28.menu.bodvoltage.2v70=2.70V
avrdx28.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx28.menu.bodvoltage.2v85=2.85V
avrdx28.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx28.menu.bodmodeactive.disabled=Disabled
avrdx28.menu.bodmodeactive.enabled=Enabled
avrdx28.menu.bodmodeactive.sampled=Sampled
avrdx28.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx28.menu.bodmodesleep.disabled=Disabled
avrdx28.menu.bodmodesleep.enabled=Enabled
avrdx28.menu.bodmodesleep.sampled=Sampled
avrdx28.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx28.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx28.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx28.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx28.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx28.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx28.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdx28.menu.eesave.enable=EEPROM retained
avrdx28.menu.eesave.enable.bootloader.eesavebit=1
avrdx28.menu.eesave.disable=EEPROM not retained
avrdx28.menu.eesave.disable.bootloader.eesavebit=0

avrdx28.menu.resetpin.reset=Hardware Reset (recommended)
avrdx28.menu.resetpin.reset.bootloader.resetpinbits=10
avrdx28.menu.resetpin.input=Input (no output, ever)
avrdx28.menu.resetpin.input.bootloader.resetpinbits=00

avrdx28.menu.millis.tcb2=TCB2 (recommended)
avrdx28.menu.millis.tca0=TCA0
avrdx28.menu.millis.tcb2=TCB0 (will break Servo)
avrdx28.menu.millis.tcb2=TCB1 (will break tone)
avrdx28.menu.millis.tcd0=TCD0
avrdx28.menu.millis.disabled=Disabled

avrdx28.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx28.menu.millis.tcb0.build.millistimer=B0
avrdx28.menu.millis.tcb1.build.millistimer=B1
avrdx28.menu.millis.tcb2.build.millistimer=B2
avrdx28.menu.millis.tca0.build.millistimer=A0
avrdx28.menu.millis.tcd0.build.millistimer=D0
avrdx28.menu.millis.disabled.build.millistimer=NONE

avrdx28.upload.tool=avrdude

avrdx28.build.board=avrdx28
avrdx28.build.core=dxcore
avrdx28.build.variant=28pin-standard
avrdx28.build.text_section_start=.text=0x0
avrdx28.build.extra_flags={build.millis} {build.adcworkaround}
avrdx28.build.export_merged_output=false
avrdx28.build.mcupostfix=

avrdx28.bootloader.tool=avrdude
avrdx28.bootloader.WDTCFG=0x00
avrdx28.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx28.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdx28.bootloader.SYSCFG1=0x03
avrdx28.bootloader.CODESIZE=0x00
avrdx28.bootloader.BOOTSIZE=0x00

avrdx28.bootloader.flashcommand=



#########################################
#
#    32 PIN AVR Dx-series
#
#########################################


avrdx32.name=32-pin AVR DA or DB

avrdx32.bootloader.SYSCFG1=0x03

avrdx32.menu.chip.128A=AVR128DA32
avrdx32.menu.chip.128A.build.mcu=avr128da32
avrdx32.menu.chip.128A.upload.maximum_size=131072
avrdx32.menu.chip.128A.upload.maximum_data_size=16384
avrdx32.menu.chip.64A=AVR64DA32
avrdx32.menu.chip.64A.build.mcu=avr64da32
avrdx32.menu.chip.64A.upload.maximum_size=65536
avrdx32.menu.chip.64A.upload.maximum_data_size=8192
avrdx32.menu.chip.32A=AVR32DA32
avrdx32.menu.chip.32A.build.mcu=avr32da32
avrdx32.menu.chip.32A.upload.maximum_size=32768
avrdx32.menu.chip.32A.upload.maximum_data_size=4096
avrdx32.menu.chip.128B=AVR128DB32
avrdx32.menu.chip.128B.build.mcu=avr128db32
avrdx32.menu.chip.128B.upload.maximum_size=131072
avrdx32.menu.chip.128B.upload.maximum_data_size=16384
avrdx32.menu.chip.128B.bootloader.SYSCFG1=0x0B


avrdx32.menu.clock.24=24 MHz
avrdx32.menu.clock.24.build.f_cpu=24000000L
avrdx32.menu.clock.24.build.speed=24
avrdx32.menu.clock.20=20 MHz
avrdx32.menu.clock.20.build.f_cpu=20000000L
avrdx32.menu.clock.20.build.speed=20
avrdx32.menu.clock.16=16 MHz
avrdx32.menu.clock.16.build.f_cpu=16000000L
avrdx32.menu.clock.16.build.speed=16
avrdx32.menu.clock.12=12 MHz
avrdx32.menu.clock.12.build.f_cpu=12000000L
avrdx32.menu.clock.12.build.speed=12
avrdx32.menu.clock.10=10 MHz
avrdx32.menu.clock.10.build.f_cpu=10000000L
avrdx32.menu.clock.10.build.speed=10
avrdx32.menu.clock.8=8 MHz
avrdx32.menu.clock.8.build.f_cpu=8000000L
avrdx32.menu.clock.8.build.speed=8
avrdx32.menu.clock.4=4 MHz
avrdx32.menu.clock.4.build.f_cpu=4000000L
avrdx32.menu.clock.4.build.speed=4
avrdx32.menu.clock.1=1 MHz
avrdx32.menu.clock.1.build.f_cpu=1000000L
avrdx32.menu.clock.1.build.speed=1
avrdx32.menu.clock.28=28 MHz (overclocked)
avrdx32.menu.clock.28.build.f_cpu=28000000L
avrdx32.menu.clock.28.build.speed=28
avrdx32.menu.clock.32=32 MHz (overclocked)
avrdx32.menu.clock.32.build.f_cpu=32000000L
avrdx32.menu.clock.32.build.speed=32

