SpenceKonde/DxCore/megaavr/boards.txt
avrdx32.build.adcworkaround=
avrdx32.menu.adcworkaround.simple=Simple
avrdx32.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx32.menu.adcworkaround.none=Startup only



avrdx32.menu.bodvoltage.1v9=1.9V
avrdx32.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx32.menu.bodvoltage.2v45=2.45V
avrdx32.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx32.menu.bodvoltage.2v70=2.70V
avrdx32.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx32.menu.bodvoltage.2v85=2.85V
avrdx32.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx32.menu.bodmodeactive.disabled=Disabled
avrdx32.menu.bodmodeactive.enabled=Enabled
avrdx32.menu.bodmodeactive.sampled=Sampled
avrdx32.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx32.menu.bodmodesleep.disabled=Disabled
avrdx32.menu.bodmodesleep.enabled=Enabled
avrdx32.menu.bodmodesleep.sampled=Sampled
avrdx32.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx32.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx32.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx32.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx32.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx32.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx32.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdx32.menu.eesave.enable=EEPROM retained
avrdx32.menu.eesave.enable.bootloader.eesavebit=1
avrdx32.menu.eesave.disable=EEPROM not retained
avrdx32.menu.eesave.disable.bootloader.eesavebit=0

avrdx32.menu.resetpin.reset=Hardware Reset (recommended)
avrdx32.menu.resetpin.reset.bootloader.resetpinbits=10
avrdx32.menu.resetpin.input=Input (no output, ever)
avrdx32.menu.resetpin.input.bootloader.resetpinbits=00

avrdx32.menu.millis.tcb2=TCB2 (recommended)
avrdx32.menu.millis.tca0=TCA0
avrdx32.menu.millis.tcb0=TCB0 (will break Servo)
avrdx32.menu.millis.tcb2=TCB1
avrdx32.menu.millis.tcd0=TCD0
avrdx32.menu.millis.disabled=Disabled

avrdx32.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx32.menu.millis.tcb0.build.millistimer=B0
avrdx32.menu.millis.tcb1.build.millistimer=B1
avrdx32.menu.millis.tcb2.build.millistimer=B2
avrdx32.menu.millis.tca0.build.millistimer=A0
avrdx32.menu.millis.tcd0.build.millistimer=D0
avrdx32.menu.millis.disabled.build.millistimer=NONE

avrdx32.upload.tool=avrdude

avrdx32.build.board=avrdx32
avrdx32.build.core=dxcore
avrdx32.build.variant=32pin-standard
avrdx32.build.text_section_start=.text=0x0
avrdx32.build.extra_flags={build.millis} {build.adcworkaround}
avrdx32.build.export_merged_output=false
avrdx32.build.mcupostfix=

avrdx32.bootloader.tool=avrdude
avrdx32.bootloader.WDTCFG=0x00
avrdx32.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx32.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdx32.bootloader.SYSCFG1=0x03
avrdx32.bootloader.CODESIZE=0x00
avrdx32.bootloader.BOOTSIZE=0x00

avrdx32.bootloader.flashcommand=






#########################################
#
#    48 PIN AVR DA-series
#
#########################################



avrdx48.name=48-pin AVR DA or DB

avrdx48.bootloader.SYSCFG1=0x03

avrdx48.menu.chip.128A=AVR128DA48
avrdx48.menu.chip.128A.build.mcu=avr128da48
avrdx48.menu.chip.128A.upload.maximum_size=131072
avrdx48.menu.chip.128A.upload.maximum_data_size=16384
avrdx48.menu.chip.64A=AVR64DA48
avrdx48.menu.chip.64A.build.mcu=avr64da48
avrdx48.menu.chip.64A.upload.maximum_size=65536
avrdx48.menu.chip.64A.upload.maximum_data_size=8192
avrdx48.menu.chip.32A=AVR32DA48
avrdx48.menu.chip.32A.build.mcu=avr32da48
avrdx48.menu.chip.32A.upload.maximum_size=32768
avrdx48.menu.chip.32A.upload.maximum_data_size=4096
avrdx48.menu.chip.128B=AVR128DB48
avrdx48.menu.chip.128B.build.mcu=avr128db48
avrdx48.menu.chip.128B.upload.maximum_size=131072
avrdx48.menu.chip.128B.upload.maximum_data_size=16384
avrdx48.menu.chip.128B.bootloader.SYSCFG1=0x0B


avrdx48.menu.clock.24=24 MHz
avrdx48.menu.clock.24.build.f_cpu=24000000L
avrdx48.menu.clock.24.build.speed=24
avrdx48.menu.clock.20=20 MHz
avrdx48.menu.clock.20.build.f_cpu=20000000L
avrdx48.menu.clock.20.build.speed=20
avrdx48.menu.clock.16=16 MHz
avrdx48.menu.clock.16.build.f_cpu=16000000L
avrdx48.menu.clock.16.build.speed=16
avrdx48.menu.clock.12=12 MHz
avrdx48.menu.clock.12.build.f_cpu=12000000L
avrdx48.menu.clock.12.build.speed=12
avrdx48.menu.clock.10=10 MHz
avrdx48.menu.clock.10.build.f_cpu=10000000L
avrdx48.menu.clock.10.build.speed=10
avrdx48.menu.clock.8=8 MHz
avrdx48.menu.clock.8.build.f_cpu=8000000L
avrdx48.menu.clock.8.build.speed=8
avrdx48.menu.clock.4=4 MHz
avrdx48.menu.clock.4.build.f_cpu=4000000L
avrdx48.menu.clock.4.build.speed=4
avrdx48.menu.clock.1=1 MHz
avrdx48.menu.clock.1.build.f_cpu=1000000L
avrdx48.menu.clock.1.build.speed=1
avrdx48.menu.clock.28=28 MHz (overclocked)
avrdx48.menu.clock.28.build.f_cpu=28000000L
avrdx48.menu.clock.28.build.speed=28
avrdx48.menu.clock.32=32 MHz (overclocked)
avrdx48.menu.clock.32.build.f_cpu=32000000L
avrdx48.menu.clock.32.build.speed=32


avrdx48.build.adcworkaround=
avrdx48.menu.adcworkaround.simple=Simple
avrdx48.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx48.menu.adcworkaround.none=Startup only


avrdx48.menu.bodvoltage.1v9=1.9V
avrdx48.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx48.menu.bodvoltage.2v45=2.45V
avrdx48.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx48.menu.bodvoltage.2v70=2.70V
avrdx48.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx48.menu.bodvoltage.2v85=2.85V
avrdx48.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx48.menu.bodmodeactive.disabled=Disabled
avrdx48.menu.bodmodeactive.enabled=Enabled
avrdx48.menu.bodmodeactive.sampled=Sampled
avrdx48.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx48.menu.bodmodesleep.disabled=Disabled
avrdx48.menu.bodmodesleep.enabled=Enabled
avrdx48.menu.bodmodesleep.sampled=Sampled
avrdx48.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx48.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx48.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx48.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx48.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx48.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx48.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdx48.menu.eesave.enable=EEPROM retained
avrdx48.menu.eesave.enable.bootloader.eesavebit=1
avrdx48.menu.eesave.disable=EEPROM not retained
avrdx48.menu.eesave.disable.bootloader.eesavebit=0

avrdx48.menu.resetpin.reset=Hardware Reset (recommended)
avrdx48.menu.resetpin.reset.bootloader.resetpinbits=10
avrdx48.menu.resetpin.input=Input (no output, ever)
avrdx48.menu.resetpin.input.bootloader.resetpinbits=00

avrdx48.menu.millis.tcb2=TCB2 (recommended)
avrdx48.menu.millis.tca0=TCA0
avrdx48.menu.millis.tca1=TCA1
avrdx48.menu.millis.tcb0=TCB0 (will break Servo)
avrdx48.menu.millis.tcb1=TCB1
avrdx48.menu.millis.tcb3=TCB3 (will break tone)
avrdx48.menu.millis.tcd0=TCD0
avrdx48.menu.millis.disabled=Disabled

