SpenceKonde/DxCore/megaavr/boards.txt
avrdx28opti.bootloader.SYSCFG1=0x03

avrdx28opti.menu.chip.128A=AVR128DA28
avrdx28opti.menu.chip.128A.build.mcu=avr128da28
avrdx28opti.menu.chip.128A.upload.maximum_size=130048
avrdx28opti.menu.chip.128A.upload.maximum_data_size=16384
avrdx28opti.menu.chip.128A.bootloader.file=hex/optiboot_dx128
avrdx28opti.menu.chip.64A=AVR64DA28
avrdx28opti.menu.chip.64A.build.mcu=avr64da28
avrdx28opti.menu.chip.64A.upload.maximum_size=64512
avrdx28opti.menu.chip.64A.upload.maximum_data_size=8192
avrdx28opti.menu.chip.64A.bootloader.file=hex/optiboot_dx32
avrdx28opti.menu.chip.32A=AVR32DA28
avrdx28opti.menu.chip.32A.build.mcu=avr32da28
avrdx28opti.menu.chip.32A.upload.maximum_size=32768
avrdx28opti.menu.chip.32A.upload.maximum_data_size=4096
avrdx28opti.menu.chip.64A.bootloader.file=hex/optiboot_dx64
avrdx28opti.menu.chip.128B=AVR128DB28
avrdx28opti.menu.chip.128B.build.mcu=avr128db28
avrdx28opti.menu.chip.128B.upload.maximum_size=130048
avrdx28opti.menu.chip.128B.upload.maximum_data_size=16384
avrdx28opti.menu.chip.128B.bootloader.file=hex/optiboot_dx128
avrdx28opti.menu.chip.128B.bootloader.SYSCFG1=0x0B


avrdx28opti.menu.clock.24=24 MHz
avrdx28opti.menu.clock.24.build.f_cpu=24000000L
avrdx28opti.menu.clock.24.build.speed=24
avrdx28opti.menu.clock.20=20 MHz
avrdx28opti.menu.clock.20.build.f_cpu=20000000L
avrdx28opti.menu.clock.20.build.speed=20
avrdx28opti.menu.clock.16=16 MHz
avrdx28opti.menu.clock.16.build.f_cpu=16000000L
avrdx28opti.menu.clock.16.build.speed=16
avrdx28opti.menu.clock.12=12 MHz
avrdx28opti.menu.clock.12.build.f_cpu=12000000L
avrdx28opti.menu.clock.12.build.speed=12
avrdx28opti.menu.clock.10=10 MHz
avrdx28opti.menu.clock.10.build.f_cpu=10000000L
avrdx28opti.menu.clock.10.build.speed=10
avrdx28opti.menu.clock.8=8 MHz
avrdx28opti.menu.clock.8.build.f_cpu=8000000L
avrdx28opti.menu.clock.8.build.speed=8
avrdx28opti.menu.clock.4=4 MHz
avrdx28opti.menu.clock.4.build.f_cpu=4000000L
avrdx28opti.menu.clock.4.build.speed=4
avrdx28opti.menu.clock.1=1 MHz
avrdx28opti.menu.clock.1.build.f_cpu=1000000L
avrdx28opti.menu.clock.1.build.speed=1
avrdx28opti.menu.clock.28=28 MHz (overclocked)
avrdx28opti.menu.clock.28.build.f_cpu=28000000L
avrdx28opti.menu.clock.28.build.speed=28
avrdx28opti.menu.clock.32=32 MHz (overclocked)
avrdx28opti.menu.clock.32.build.f_cpu=32000000L
avrdx28opti.menu.clock.32.build.speed=32

avrdx28opti.build.adcworkaround=
avrdx28opti.menu.adcworkaround.simple=Enabled
avrdx28opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx28opti.menu.adcworkaround.none=Disabled

avrdx28opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrdx28opti.menu.timeout.1sec.bootloader.timeout=
avrdx28opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrdx28opti.menu.timeout.8sec.bootloader.timeout=_8sec


avrdx28opti.menu.bodvoltage.1v9=1.9V
avrdx28opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx28opti.menu.bodvoltage.2v45=2.45V
avrdx28opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx28opti.menu.bodvoltage.2v70=2.70V
avrdx28opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx28opti.menu.bodvoltage.2v85=2.85V
avrdx28opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx28opti.menu.bodmodeactive.disabled=Disabled
avrdx28opti.menu.bodmodeactive.enabled=Enabled
avrdx28opti.menu.bodmodeactive.sampled=Sampled
avrdx28opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx28opti.menu.bodmodesleep.disabled=Disabled
avrdx28opti.menu.bodmodesleep.enabled=Enabled
avrdx28opti.menu.bodmodesleep.sampled=Sampled
avrdx28opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx28opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx28opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx28opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx28opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx28opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx28opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdx28opti.menu.millis.tcb2=TCB2 (recommended)
avrdx28opti.menu.millis.tca0=TCA0
avrdx28opti.menu.millis.tcb2=TCB0 (will break Servo)
avrdx28opti.menu.millis.tcb2=TCB1 (will break tone)
avrdx28opti.menu.millis.tcd0=TCD0
avrdx28opti.menu.millis.disabled=Disabled

avrdx28opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx28opti.menu.millis.tcb0.build.millistimer=B0
avrdx28opti.menu.millis.tcb1.build.millistimer=B1
avrdx28opti.menu.millis.tcb2.build.millistimer=B2
avrdx28opti.menu.millis.tca0.build.millistimer=A0
avrdx28opti.menu.millis.tcd0.build.millistimer=D0
avrdx28opti.menu.millis.disabled.build.millistimer=NONE

avrdx28opti.upload.tool=avrdude

avrdx28opti.build.board=avrdx28
avrdx28opti.build.core=dxcore
avrdx28opti.build.variant=28pin-standard
avrdx28opti.build.extra_flags={build.millis} {build.adcworkaround}
avrdx28opti.build.export_merged_output=true

avrdx28opti.bootloader.tool=avrdude
avrdx28opti.bootloader.WDTCFG=0x00
avrdx28opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx28opti.bootloader.SYSCFG0=0xC8
avrdx28opti.bootloader.SYSCFG1=0x03
avrdx28opti.bootloader.CODESIZE=0x00
avrdx28opti.bootloader.BOOTSIZE=0x02

avrdx28opti.upload.protocol=arduino
avrdx28opti.upload.extra_params=-D
avrdx28opti.upload.speed=115200
avrdx28opti.build.text_section_start=.text=0x400
avrdx28opti.build.mcupostfix=opti
avrdx28opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrdx28opti.bootloader.tool=avrdude
avrdx28opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrdx28opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdx28opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrdx28opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdx28opti.menu.bootloaderusart.ser1=USART1, TX PC0 (8), RX PC1 (9)
avrdx28opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdx28opti.menu.bootloaderusart.ser2=USART2, TX PF0 (20), RX PF1 (21)
avrdx28opti.menu.bootloaderusart.ser2.bootloader.port=_ser2

#########################################
#
#    32 PIN AVR Dx-series Optiboot
#
#########################################


