SpenceKonde/DxCore/megaavr/boards.txt
avrdx32opti.name=32-pin AVR DA or DB with Optiboot

avrdx32opti.bootloader.SYSCFG1=0x03

avrdx32opti.menu.chip.128A=AVR128DA32
avrdx32opti.menu.chip.128A.build.mcu=avr128da32
avrdx32opti.menu.chip.128A.upload.maximum_size=130048
avrdx32opti.menu.chip.128A.upload.maximum_data_size=16384
avrdx32opti.menu.chip.128A.bootloader.file=hex/optiboot_dx128
avrdx32opti.menu.chip.64A=AVR64DA32
avrdx32opti.menu.chip.64A.build.mcu=avr64da32
avrdx32opti.menu.chip.64A.upload.maximum_size=64512
avrdx32opti.menu.chip.64A.upload.maximum_data_size=8192
avrdx32opti.menu.chip.64A.bootloader.file=hex/optiboot_dx64
avrdx32opti.menu.chip.32A=AVR32DA32
avrdx32opti.menu.chip.32A.build.mcu=avr32da32
avrdx32opti.menu.chip.32A.upload.maximum_size=31744
avrdx32opti.menu.chip.32A.upload.maximum_data_size=4096
avrdx32opti.menu.chip.32A.bootloader.file=hex/optiboot_dx32
avrdx32opti.menu.chip.128B=AVR128DB32
avrdx32opti.menu.chip.128B.build.mcu=avr128db32
avrdx32opti.menu.chip.128B.upload.maximum_size=130048
avrdx32opti.menu.chip.128B.upload.maximum_data_size=16384
avrdx32opti.menu.chip.128B.bootloader.file=hex/optiboot_dx128
avrdx32opti.menu.chip.128B.bootloader.SYSCFG1=0x0B
#avrdx32opti.menu.chip.64B=AVR64DB32
#avrdx32opti.menu.chip.64B.build.mcu=avr64db32
#avrdx32opti.menu.chip.64B.upload.maximum_size=64512
#avrdx32opti.menu.chip.64B.upload.maximum_data_size=8192
#avrdx32opti.menu.chip.64B.bootloader.file=hex/optiboot_dx64
#avrdx32opti.menu.chip.32B=AVR32DB32
#avrdx32opti.menu.chip.32B.build.mcu=avr32db32
#avrdx32opti.menu.chip.32B.upload.maximum_size=31744
#avrdx32opti.menu.chip.32B.upload.maximum_data_size=4096
#avrdx32opti.menu.chip.32B.bootloader.file=hex/optiboot_dx32

avrdx32opti.menu.clock.24=24 MHz
avrdx32opti.menu.clock.24.build.f_cpu=24000000L
avrdx32opti.menu.clock.24.build.speed=24
avrdx32opti.menu.clock.20=20 MHz
avrdx32opti.menu.clock.20.build.f_cpu=20000000L
avrdx32opti.menu.clock.20.build.speed=20
avrdx32opti.menu.clock.16=16 MHz
avrdx32opti.menu.clock.16.build.f_cpu=16000000L
avrdx32opti.menu.clock.16.build.speed=16
avrdx32opti.menu.clock.12=12 MHz
avrdx32opti.menu.clock.12.build.f_cpu=12000000L
avrdx32opti.menu.clock.12.build.speed=12
avrdx32opti.menu.clock.10=10 MHz
avrdx32opti.menu.clock.10.build.f_cpu=10000000L
avrdx32opti.menu.clock.10.build.speed=10
avrdx32opti.menu.clock.8=8 MHz
avrdx32opti.menu.clock.8.build.f_cpu=8000000L
avrdx32opti.menu.clock.8.build.speed=8
avrdx32opti.menu.clock.4=4 MHz
avrdx32opti.menu.clock.4.build.f_cpu=4000000L
avrdx32opti.menu.clock.4.build.speed=4
avrdx32opti.menu.clock.1=1 MHz
avrdx32opti.menu.clock.1.build.f_cpu=1000000L
avrdx32opti.menu.clock.1.build.speed=1
avrdx32opti.menu.clock.28=28 MHz (overclocked)
avrdx32opti.menu.clock.28.build.f_cpu=28000000L
avrdx32opti.menu.clock.28.build.speed=28
avrdx32opti.menu.clock.32=32 MHz (overclocked)
avrdx32opti.menu.clock.32.build.f_cpu=32000000L
avrdx32opti.menu.clock.32.build.speed=32

avrdx32opti.build.adcworkaround=
avrdx32opti.menu.adcworkaround.simple=Simple
avrdx32opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx32opti.menu.adcworkaround.none=Startup only
avrdx32opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrdx32opti.menu.timeout.1sec.bootloader.timeout=
avrdx32opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrdx32opti.menu.timeout.8sec.bootloader.timeout=_8sec



avrdx32opti.menu.bodvoltage.1v9=1.9V
avrdx32opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx32opti.menu.bodvoltage.2v45=2.45V
avrdx32opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx32opti.menu.bodvoltage.2v70=2.70V
avrdx32opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx32opti.menu.bodvoltage.2v85=2.85V
avrdx32opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx32opti.menu.bodmodeactive.disabled=Disabled
avrdx32opti.menu.bodmodeactive.enabled=Enabled
avrdx32opti.menu.bodmodeactive.sampled=Sampled
avrdx32opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx32opti.menu.bodmodesleep.disabled=Disabled
avrdx32opti.menu.bodmodesleep.enabled=Enabled
avrdx32opti.menu.bodmodesleep.sampled=Sampled
avrdx32opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx32opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx32opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx32opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx32opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx32opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx32opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdx32opti.menu.millis.tcb2=TCB2 (recommended)
avrdx32opti.menu.millis.tca0=TCA0
avrdx32opti.menu.millis.tcb0=TCB0 (will break Servo)
avrdx32opti.menu.millis.tcb2=TCB1
avrdx32opti.menu.millis.tcd0=TCD0
avrdx32opti.menu.millis.disabled=Disabled

avrdx32opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx32opti.menu.millis.tcb0.build.millistimer=B0
avrdx32opti.menu.millis.tcb1.build.millistimer=B1
avrdx32opti.menu.millis.tcb2.build.millistimer=B2
avrdx32opti.menu.millis.tca0.build.millistimer=A0
avrdx32opti.menu.millis.tcd0.build.millistimer=D0
avrdx32opti.menu.millis.disabled.build.millistimer=NONE

avrdx32opti.upload.tool=avrdude

avrdx32opti.build.board=avrdx32
avrdx32opti.build.core=dxcore
avrdx32opti.build.variant=32pin-standard
avrdx32opti.build.extra_flags={build.millis} {build.adcworkaround}

avrdx32opti.bootloader.tool=avrdude
avrdx32opti.bootloader.WDTCFG=0x00
avrdx32opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx32opti.bootloader.SYSCFG0=0xC8
avrdx32opti.bootloader.SYSCFG1=0x03
avrdx32opti.bootloader.CODESIZE=0x00
avrdx32opti.bootloader.BOOTSIZE=0x02

avrdx32opti.upload.protocol=arduino
avrdx32opti.upload.extra_params=-D
avrdx32opti.upload.speed=115200
avrdx32opti.build.text_section_start=.text=0x400
avrdx32opti.build.mcupostfix=opti
avrdx32opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrdx32opti.bootloader.tool=avrdude

avrdx32opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrdx32opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdx32opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrdx32opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdx32opti.menu.bootloaderusart.ser1=USART1, TX PC0 (8), RX PC1 (9)
avrdx32opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdx32opti.menu.bootloaderusart.ser2=USART2, TX PF0 (20), RX PF1 (21)
avrdx32opti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdx32opti.menu.bootloaderusart.ser2_alt=USART2, TX PF4 (24), RX PF5 (25)
avrdx32opti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt

#########################################
#
#    48 PIN AVR DA-series
#
#########################################



avrdx48opti.name=48-pin AVR DA or DB with Optiboot
avrdx48opti.bootloader.SYSCFG1=0x03

avrdx48opti.menu.chip.128A=AVR128DA48
avrdx48opti.menu.chip.128A.build.mcu=avr128da48
avrdx48opti.menu.chip.128A.upload.maximum_size=130048
avrdx48opti.menu.chip.128A.upload.maximum_data_size=16384
avrdx48opti.menu.chip.128A.bootloader.file=hex/optiboot_dx128
avrdx48opti.menu.chip.64A=AVR64DA48
avrdx48opti.menu.chip.64A.build.mcu=avr64da48
avrdx48opti.menu.chip.64A.upload.maximum_size=64512
avrdx48opti.menu.chip.64A.upload.maximum_data_size=8192
avrdx48opti.menu.chip.64A.bootloader.file=hex/optiboot_dx64
avrdx48opti.menu.chip.32A=AVR32DA48
avrdx48opti.menu.chip.32A.build.mcu=avr32da48
avrdx48opti.menu.chip.32A.upload.maximum_size=31744
avrdx48opti.menu.chip.32A.upload.maximum_data_size=4096
avrdx48opti.menu.chip.32A.bootloader.file=hex/optiboot_dx32
avrdx48opti.menu.chip.128B=AVR128DB48
avrdx48opti.menu.chip.128B.build.mcu=avr128db48
avrdx48opti.menu.chip.128B.upload.maximum_size=130048
avrdx48opti.menu.chip.128B.upload.maximum_data_size=16384
avrdx48opti.menu.chip.128B.bootloader.file=hex/optiboot_dx128
avrdx48opti.menu.chip.128B.bootloader.SYSCFG1=0x0B
#avrdx48opti.menu.chip.64B=AVR64DB48
#avrdx48opti.menu.chip.64B.build.mcu=avr64db48
#avrdx48opti.menu.chip.64B.upload.maximum_size=64512
#avrdx48opti.menu.chip.64B.upload.maximum_data_size=8192
#avrdx48opti.menu.chip.64B.bootloader.file=hex/optiboot_dx64
#avrdx48opti.menu.chip.32B=AVR32DB48
#avrdx48opti.menu.chip.32B.build.mcu=avr32db48
#avrdx48opti.menu.chip.32B.upload.maximum_size=31744
#avrdx48opti.menu.chip.32B.upload.maximum_data_size=4096
#avrdx48opti.menu.chip.32B.bootloader.file=hex/optiboot_dx32


avrdx48opti.menu.clock.24=24 MHz
avrdx48opti.menu.clock.24.build.f_cpu=24000000L
avrdx48opti.menu.clock.24.build.speed=24
avrdx48opti.menu.clock.20=20 MHz
avrdx48opti.menu.clock.20.build.f_cpu=20000000L
avrdx48opti.menu.clock.20.build.speed=20
avrdx48opti.menu.clock.16=16 MHz
avrdx48opti.menu.clock.16.build.f_cpu=16000000L
avrdx48opti.menu.clock.16.build.speed=16
avrdx48opti.menu.clock.12=12 MHz
avrdx48opti.menu.clock.12.build.f_cpu=12000000L
avrdx48opti.menu.clock.12.build.speed=12
avrdx48opti.menu.clock.10=10 MHz
avrdx48opti.menu.clock.10.build.f_cpu=10000000L
avrdx48opti.menu.clock.10.build.speed=10
avrdx48opti.menu.clock.8=8 MHz
avrdx48opti.menu.clock.8.build.f_cpu=8000000L
avrdx48opti.menu.clock.8.build.speed=8
avrdx48opti.menu.clock.4=4 MHz
avrdx48opti.menu.clock.4.build.f_cpu=4000000L
avrdx48opti.menu.clock.4.build.speed=4
avrdx48opti.menu.clock.1=1 MHz
avrdx48opti.menu.clock.1.build.f_cpu=1000000L
avrdx48opti.menu.clock.1.build.speed=1
avrdx48opti.menu.clock.28=28 MHz (overclocked)
avrdx48opti.menu.clock.28.build.f_cpu=28000000L
avrdx48opti.menu.clock.28.build.speed=28
avrdx48opti.menu.clock.32=32 MHz (overclocked)
avrdx48opti.menu.clock.32.build.f_cpu=32000000L
avrdx48opti.menu.clock.32.build.speed=32


avrdx48opti.build.adcworkaround=
avrdx48opti.menu.adcworkaround.simple=Simple
avrdx48opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx48opti.menu.adcworkaround.none=Startup only

avrdx48opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrdx48opti.menu.timeout.1sec.bootloader.timeout=
avrdx48opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrdx48opti.menu.timeout.8sec.bootloader.timeout=_8sec

