SpenceKonde/DxCore/megaavr/boards.txt
avrdx48opti.menu.bodvoltage.1v9=1.9V
avrdx48opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx48opti.menu.bodvoltage.2v45=2.45V
avrdx48opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx48opti.menu.bodvoltage.2v70=2.70V
avrdx48opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx48opti.menu.bodvoltage.2v85=2.85V
avrdx48opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx48opti.menu.bodmodeactive.disabled=Disabled
avrdx48opti.menu.bodmodeactive.enabled=Enabled
avrdx48opti.menu.bodmodeactive.sampled=Sampled
avrdx48opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx48opti.menu.bodmodesleep.disabled=Disabled
avrdx48opti.menu.bodmodesleep.enabled=Enabled
avrdx48opti.menu.bodmodesleep.sampled=Sampled
avrdx48opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx48opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx48opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx48opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx48opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx48opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx48opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

avrdx48opti.menu.millis.tcb2=TCB2 (recommended)
avrdx48opti.menu.millis.tca0=TCA0
avrdx48opti.menu.millis.tca1=TCA1
avrdx48opti.menu.millis.tcb0=TCB0 (will break Servo)
avrdx48opti.menu.millis.tcb1=TCB1
avrdx48opti.menu.millis.tcb3=TCB3 (will break tone)
avrdx48opti.menu.millis.tcd0=TCD0
avrdx48opti.menu.millis.disabled=Disabled

avrdx48opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx48opti.menu.millis.tcb0.build.millistimer=B0
avrdx48opti.menu.millis.tcb1.build.millistimer=B1
avrdx48opti.menu.millis.tcb2.build.millistimer=B2
avrdx48opti.menu.millis.tcb3.build.millistimer=B2
avrdx48opti.menu.millis.tca0.build.millistimer=A0
avrdx48opti.menu.millis.tca1.build.millistimer=A1
avrdx48opti.menu.millis.tcd0.build.millistimer=D0
avrdx48opti.menu.millis.disabled.build.millistimer=NONE

avrdx48opti.upload.tool=avrdude

avrdx48opti.build.board=avrdx48
avrdx48opti.build.core=dxcore
avrdx48opti.build.variant=48pin-standard
avrdx48opti.build.extra_flags={build.millis} {build.adcworkaround}
avrdx48opti.build.export_merged_output=true

avrdx48opti.bootloader.tool=avrdude
avrdx48opti.bootloader.WDTCFG=0x00
avrdx48opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx48opti.bootloader.SYSCFG0=0xC8
avrdx48opti.bootloader.SYSCFG1=0x03
avrdx48opti.bootloader.CODESIZE=0x00
avrdx48opti.bootloader.BOOTSIZE=0x02

avrdx48opti.upload.protocol=arduino
avrdx48opti.upload.extra_params=-D
avrdx48opti.upload.speed=115200
avrdx48opti.build.text_section_start=.text=0x400
avrdx48opti.build.mcupostfix=opti
avrdx48opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrdx48opti.bootloader.tool=avrdude

avrdx48opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrdx48opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdx48opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrdx48opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdx48opti.menu.bootloaderusart.ser1=USART1, TX PC0 (14), RX PC1 (15)
avrdx48opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdx48opti.menu.bootloaderusart.ser1_alt=USART1, TX PC4 (18), RX PC5 (19)
avrdx48opti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdx48opti.menu.bootloaderusart.ser2=USART2, TX PF0 (34), RX PF1 (35)
avrdx48opti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdx48opti.menu.bootloaderusart.ser2_alt=USART2, TX PF4 (38), RX PF5 (39)
avrdx48opti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdx48opti.menu.bootloaderusart.ser3=USART3, TX PB0 (8), RX PB1 (9)
avrdx48opti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdx48opti.menu.bootloaderusart.ser3_alt=USART3, TX PB4 (12), RX PB5 (13)
avrdx48opti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdx48opti.menu.bootloaderusart.ser4=USART4, TX PE0 (30), RX PE1 (31)
avrdx48opti.menu.bootloaderusart.ser4.bootloader.port=_ser4



#########################################
#
#    64 PIN AVR Dx-series
#
#########################################


avrdx64opti.name=64-pin AVR DA or DB with Optiboot


avrdx64opti.bootloader.SYSCFG1=0x03

avrdx64opti.menu.chip.128A=AVR128DA64
avrdx64opti.menu.chip.128A.build.mcu=avr128da64
avrdx64opti.menu.chip.128A.upload.maximum_size=130048
avrdx64opti.menu.chip.128A.upload.maximum_data_size=16384
avrdx64opti.menu.chip.128A.bootloader.file=hex/optiboot_dx128
avrdx64opti.menu.chip.64A=AVR64DA64
avrdx64opti.menu.chip.64A.build.mcu=avr64da64
avrdx64opti.menu.chip.64A.upload.maximum_size=64512
avrdx64opti.menu.chip.64A.upload.maximum_data_size=8192
avrdx64opti.menu.chip.64A.bootloader.file=hex/optiboot_dx64
avrdx64opti.menu.chip.128B=AVR128DB64
avrdx64opti.menu.chip.128B.build.mcu=avr128db64
avrdx64opti.menu.chip.128B.upload.maximum_size=130048
avrdx64opti.menu.chip.128B.upload.maximum_data_size=16384
avrdx64opti.menu.chip.128B.bootloader.file=hex/optiboot_dx128
avrdx64opti.menu.chip.128B.bootloader.SYSCFG1=0x0B


avrdx64opti.menu.clock.24=24 MHz
avrdx64opti.menu.clock.24.build.f_cpu=24000000L
avrdx64opti.menu.clock.24.build.speed=24
avrdx64opti.menu.clock.20=20 MHz
avrdx64opti.menu.clock.20.build.f_cpu=20000000L
avrdx64opti.menu.clock.20.build.speed=20
avrdx64opti.menu.clock.16=16 MHz
avrdx64opti.menu.clock.16.build.f_cpu=16000000L
avrdx64opti.menu.clock.16.build.speed=16
avrdx64opti.menu.clock.12=12 MHz
avrdx64opti.menu.clock.12.build.f_cpu=12000000L
avrdx64opti.menu.clock.12.build.speed=12
avrdx64opti.menu.clock.10=10 MHz
avrdx64opti.menu.clock.10.build.f_cpu=10000000L
avrdx64opti.menu.clock.10.build.speed=10
avrdx64opti.menu.clock.8=8 MHz
avrdx64opti.menu.clock.8.build.f_cpu=8000000L
avrdx64opti.menu.clock.8.build.speed=8
avrdx64opti.menu.clock.4=4 MHz
avrdx64opti.menu.clock.4.build.f_cpu=4000000L
avrdx64opti.menu.clock.4.build.speed=4
avrdx64opti.menu.clock.1=1 MHz
avrdx64opti.menu.clock.1.build.f_cpu=1000000L
avrdx64opti.menu.clock.1.build.speed=1
avrdx64opti.menu.clock.28=28 MHz (overclocked)
avrdx64opti.menu.clock.28.build.f_cpu=28000000L
avrdx64opti.menu.clock.28.build.speed=28
avrdx64opti.menu.clock.32=32 MHz (overclocked)
avrdx64opti.menu.clock.32.build.f_cpu=32000000L
avrdx64opti.menu.clock.32.build.speed=32


avrdx64opti.build.adcworkaround=
avrdx64opti.menu.adcworkaround.simple=Simple
avrdx64opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx64opti.menu.adcworkaround.none=Startup only

avrdx64opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrdx64opti.menu.timeout.1sec.bootloader.timeout=
avrdx64opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrdx64opti.menu.timeout.8sec.bootloader.timeout=_8sec

avrdx64opti.menu.bodvoltage.1v9=1.9V
avrdx64opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx64opti.menu.bodvoltage.2v45=2.45V
avrdx64opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx64opti.menu.bodvoltage.2v70=2.70V
avrdx64opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx64opti.menu.bodvoltage.2v85=2.85V
avrdx64opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx64opti.menu.bodmodeactive.disabled=Disabled
avrdx64opti.menu.bodmodeactive.enabled=Enabled
avrdx64opti.menu.bodmodeactive.sampled=Sampled
avrdx64opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx64opti.menu.bodmodesleep.disabled=Disabled
avrdx64opti.menu.bodmodesleep.enabled=Enabled
avrdx64opti.menu.bodmodesleep.sampled=Sampled
avrdx64opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx64opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx64opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx64opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx64opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx64opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx64opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10



avrdx64opti.menu.millis.tcb2=TCB2 (recommended)
avrdx64opti.menu.millis.tca0=TCA0
avrdx64opti.menu.millis.tca1=TCA1
avrdx64opti.menu.millis.tcb0=TCB0 (will break Servo)
avrdx64opti.menu.millis.tcb1=TCB1
avrdx64opti.menu.millis.tcb3=TCB3 (will break tone)
avrdx64opti.menu.millis.tcb4=TCB4
avrdx64opti.menu.millis.tcd0=TCD0
avrdx64opti.menu.millis.disabled=Disabled

avrdx64opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx64opti.menu.millis.tcb0.build.millistimer=B0
avrdx64opti.menu.millis.tcb1.build.millistimer=B1
avrdx64opti.menu.millis.tcb2.build.millistimer=B2
avrdx64opti.menu.millis.tcb3.build.millistimer=B3
avrdx64opti.menu.millis.tcb4.build.millistimer=B4
avrdx64opti.menu.millis.tca0.build.millistimer=A0
avrdx64opti.menu.millis.tca1.build.millistimer=A1
avrdx64opti.menu.millis.tcd0.build.millistimer=D0
avrdx64opti.menu.millis.disabled.build.millistimer=NONE

