SpenceKonde/DxCore/megaavr/boards.txt
avrdx64opti.upload.tool=avrdude

avrdx64opti.build.board=avrdx64
avrdx64opti.build.core=dxcore
avrdx64opti.build.variant=64pin-standard
avrdx64opti.build.extra_flags={build.millis} {build.adcworkaround}
avrdx64opti.build.export_merged_output=true

avrdx64opti.bootloader.tool=avrdude
avrdx64opti.bootloader.WDTCFG=0x00
avrdx64opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx64opti.bootloader.SYSCFG0=0xC8
avrdx64opti.bootloader.CODESIZE=0x00
avrdx64opti.bootloader.BOOTSIZE=0x02

avrdx64opti.upload.protocol=arduino
avrdx64opti.upload.extra_params=-D
avrdx64opti.upload.speed=115200
avrdx64opti.build.text_section_start=.text=0x400
avrdx64opti.build.mcupostfix=opti
avrdx64opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrdx64opti.bootloader.tool=avrdude

avrdx64opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrdx64opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdx64opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrdx64opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdx64opti.menu.bootloaderusart.ser1=USART1, TX PC0 (16), RX PC1 (17)
avrdx64opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdx64opti.menu.bootloaderusart.ser1_alt=USART1, TX PC4 (20), RX PC5 (21)
avrdx64opti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdx64opti.menu.bootloaderusart.ser2=USART2, TX PF0 (40), RX PF1 (41)
avrdx64opti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdx64opti.menu.bootloaderusart.ser2_alt=USART2, TX PF4 (44), RX PF5 (45)
avrdx64opti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdx64opti.menu.bootloaderusart.ser3=USART3, TX PB0 (8), RX PB1 (9)
avrdx64opti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdx64opti.menu.bootloaderusart.ser3_alt=USART3, TX PB4 (12), RX PB5 (13)
avrdx64opti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdx64opti.menu.bootloaderusart.ser4=USART4, TX PE0 (32), RX PE1 (33)
avrdx64opti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrdx64opti.menu.bootloaderusart.ser4_alt=USART4, TX PE4 (36), RX PE5 (37)
avrdx64opti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrdx64opti.menu.bootloaderusart.ser5=USART5, TX PG0 (46), RX PG1 (47)
avrdx64opti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrdx64opti.menu.bootloaderusart.ser5_alt=USART5, TX PG4 (50), RX PG5 (51)
avrdx64opti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt
